
from django.db import migrations

def forwards_func(apps, schema_editor):
    # Get model
    Courses = apps.get_model('mainapp', 'Courses')
    Teachers = apps.get_model('mainapp', 'CourseTeachers')
    # Create models objects
    course_python = Courses.objects.get(id=1)
    course_python.description = """Курс Web Python позволит вам освоить язык программирования Python, '
                а также разобраться с его основными аспектами: модулями, парсерами и 
                регулярными выражениями. Курс направлен на то, чтобы вы научились составлять 
                эффективные программы для решения своих задач. Он научит вас создавать собственные
                веб-приложения для работы с базами данных и сайтами. Вы сможете использовать Python
                для изучения Java, Ruby, PHP, C, C++, C# или любого другого языка программирования.
                На курсе Web Python проходит изучение веб-фреймворков Django, Bootstrap и Flask.
                Во втором семестре вы изучите такие инструменты и методы, как PHP и MySql;
                Работа с файлами DOC, EXCEL, PATH; Реляционная и объектная модель базы данных;
                Создание и управление пакетами; Как работать с FTP-сервером; Настройка среды и
                создание сайтов; Веб-серверы; Конфигурационное управление в Unix и Windows;
                Инструменты для создания сайта; Интеграция внешних приложений; Расширения."""
    course_python.save()

    golang_teacher = Teachers.objects.get(id=1)
    course_golang = Courses.objects.get(id=2)
    course_golang.description = f""" На курсе Web Golang вы изучите основы Go, получите практические навыки реализации проектов 
                      на Golang и научитесь работать в распределённых средах разработки. Вы узнаете, что такое Go, 
                      как компилировать код Go и писать тесты. Выясните, как работает веб-сервер. Курс ведёт 
                      {golang_teacher.name_teacher} {golang_teacher.surname_teacher} - Сертифицированный специалист 
                      Google Developer Expert (Certified Technical Professional). Автор учебника «Веб-разработка на Go». 
                      На курсе вы изучите основы языка программирования Go и получите практический опыт реализации 
                      проектов на Go. """
    course_golang.save()
    #
    js_teacher_one, js_teacher_two = Teachers.objects.get(id=4), Teachers.objects.get(id=8)
    course_js = Courses.objects.get(id=3)
    course_js.description = f"""
    Курс JavaScript ведут преподаватели {js_teacher_one.name_teacher} {js_teacher_one.surname_teacher} и 
    {js_teacher_two.name_teacher} {js_teacher_two.surname_teacher}. 
    Они преподают в разных вузах, в том числе в МФТИ. {js_teacher_one.name_teacher} считает, что курс — это база знаний, которая пригодится 
    в жизни. Курс JavaScript состоит из модулей, один из которых — «Основы функционального программирования». Этот модуль
    рассчитан на тех, кто не знает основы JavaScript или только начал заниматься этим языком. Вы 
    узнаете, как устроены функции, какие бывают типы данных, как применять модификаторы. В программе 
    JavaScript: Основные паттерны проектирования (design patterns), Разработка на чистом JavaScript,
    ReactJS и AngularJS, ООП на JavaScript, Основы HTML 5 и CSS3, Javascript ES6 и ES7. 
    Кроссбраузерные основы. Погрузитесь в динамичный мир современной JS-разработки. 
    'Курс JavaScript полезен как новичкам, так и опытным разработчикам, желающим изучить новые 
    технологии и получить новые знания.
    """
    course_js.save()

    java_teacher = Teachers.objects.get(id=3)
    java_course = Courses.objects.get(id=4)
    java_course.description = f"""
    На курсе Java Вы изучите язык и фреймворк Java с самых азов до продвинутого уровня.
    А главное — получите теоретические и практические навыки для создания, отладки и 
    тестирования своих программ. В итоге вы сможете выполнить проекты любой степени сложности, 
    используя различные среды разработки и инструменты: от Eclipse IDE до IntelliJ IDEA, не говоря 
    уже о современных облачных решениях от Google и GitHub. Курс Java ведёт сильный преподаватель 
    {java_teacher.name_teacher}. {java_teacher.name_teacher} — живой пример профессионального, 
    увлечённого и целеустремлённого преподавателя.С первых занятий, уже на первом уроке вы поймёте, что преподаватель 
    заинтересован в том, чтобы его ученики непросто получили теоретические знания, а приобрели практические навыки.'
    """
    java_course.save()
    # Courses.objects.create(
    #     id = 4,
    #     name= 'Web Java',
    #     description = 'На курсе Java Вы изучите язык и фреймворк Java с самых азов до продвинутого уровня.'
    #                   'А главное — получите теоретические и практические навыки для создания, отладки и '
    #                   'тестирования своих программ. В итоге вы сможете выполнить проекты любой степени сложности,'
    #                   ' используя различные среды разработки и инструменты: от Eclipse IDE до IntelliJ IDEA, не говоря '
    #                   'уже о современных облачных решениях от Google и GitHub. Курс Java ведёт сильный преподаватель '
    #                   'Дмитрий. Дмитрий — живой пример профессионального, увлечённого и целеустремлённого преподавателя. '
    #                   'С первых занятий, уже на первом уроке вы поймёте, что преподаватель заинтересован в том, '
    #                   'чтобы его ученики непросто получили теоретические знания, а приобрели практические навыки.',
    #     description_as_markdown = False,
    #     cost = 10000,
    #     cover = 'img/course004.jpg'
    # )
    teacher_php = Teachers.objects.get(id=2)
    course_php = Courses.objects.get(id=5)
    course_php.description = f"""
    На курсе PHP вы изучите основы PHP и получите навыки работы с ним: работа с базами данных, 
    графикой, созданием сайтов, работа в PHPEdit, обработка исключений, управление памятью, 
    работа со строками и с файлами. Курс PHP позволяет получить навыки программирования на этом 
    языке. После прохождения курса вы сможете создавать собственные веб-сайты с системой
    управления, а также применять свои знания для создания полноценных информационных систем. 
    Курс PHP ведёт разработчик из Сбербанка {teacher_php.name_teacher} {teacher_php.surname_teacher}, 
    который умеет делать сложные вещи из простых. Он расскажет, 
    как сделать сайт, не имея ничего, кроме базовых знаний, и поделится важными секретами. 
    «У меня было достаточно времени, чтобы посмотреть на PHP с нуля понять, что он крутой. 
    Как-то раз меня спросили, почему я не пишу код сам, а только консультирую других. Я ответил: 
    „Потому что мне нравится помогать людям“. Но для этого надо уметь всё. PHP — это сложная штука.
    """
    # course_php.description_as_markdown = False
    course_php.save()

    teacher_pythonAI = Teachers.objects.get(id=2)
    course_pythonAI = Courses.objects.get(id=6)
    course_pythonAI.description = f"""
    На курсе Python AI вы изучите создание простых нейросетей для задач машинного зрения.
    Научитесь создавать и развивать более сложные нейросети. Курс рассчитан: Для тех, кому интересен 
    мир машинного обучения, создания ИИ и робототехники. Для специалистов в области физики, 
    математики, программирования на Python. Для всех, кто хочет прокачать свои навыки в Python, 
    а также понять алгоритм работы нейронных сетей и научиться применять их на практике. 
    Курс Python AI ведёт преподаватель школы "Фабрика Открытий" 
    {teacher_pythonAI.name_teacher} {teacher_pythonAI.surname_teacher}. Он изучает математику и IT, много программирует 
    и делает игры. Денис расскажет вам про инструменты, которые пригодятся для создания ИИ, и даст практические 
    задания — написать свою игру на Python.
    """
    course_pythonAI.save()

    teacher_devops = Teachers.objects.get(id=1)
    course_devops = Courses.objects.get(id=7)
    course_devops.description = f"""
    На курсе DevOps вы изучите основы автоматизации с Python, Git, Docker и узнаете про GitHub, 
    Jenkins и Kubernetes. Поймёте, как всё работает и зачем это нужно. Курс состоит из 12 
    онлайн-семинаров, длительностью 90 минут. Он подходит опытным программистам, которые хотят 
    усовершенствовать свои навыки в области управления проектами. На курсе вы изучите: Основные 
    возможности и функции Git: Как создавать, добавлять и удалять ветки, коммиты и теги; Как назвать
    и использовать ветку. Преподаватель - {teacher_devops.name_teacher} {teacher_devops.surname_teacher}
    """
    course_devops.save()


def reverse_func(apps, schema_editor):
    ...


class Migration(migrations.Migration):

    dependencies = [
        ('mainapp', '0014_new_teacher'),
    ]

    operations = [
        migrations.RunPython(forwards_func, reverse_func)
    ]
